---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarHookOrientation.Left
enum: Autodesk.Revit.DB.Structure.RebarHookOrientation
source: html/e8365754-0811-8d4e-864a-55bf34af3a87.htm
---
# Autodesk.Revit.DB.Structure.RebarHookOrientation.Left

Hook towards the left of a segment-based shape (RebarShapeDefinitionBySegments), or to the
 interior of an arc-based shape (RebarShapeDefinitionByArc).